RIOT-OS/RIOT/cpu/cc2538/include/vendor/hw_sys_ctrl.h
/******************************************************************************
*  Filename:       hw_sys_ctrl.h
*  Revised:        $Date: 2013-04-12 15:10:54 +0200 (Fri, 12 Apr 2013) $
*  Revision:       $Revision: 9735 $
*
*  Copyright (C) 2013 Texas Instruments Incorporated - http://www.ti.com/
*
*
*  Redistribution and use in source and binary forms, with or without
*  modification, are permitted provided that the following conditions
*  are met:
*
*    Redistributions of source code must retain the above copyright
*    notice, this list of conditions and the following disclaimer.
*
*    Redistributions in binary form must reproduce the above copyright
*    notice, this list of conditions and the following disclaimer in the
*    documentation and/or other materials provided with the distribution.
*
*    Neither the name of Texas Instruments Incorporated nor the names of
*    its contributors may be used to endorse or promote products derived
*    from this software without specific prior written permission.
*
*  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
*  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
*  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
*  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
*  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
*  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
*  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
*  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
*  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
*  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
*  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*
******************************************************************************/

#ifndef __HW_SYS_CTRL_H__
#define __HW_SYS_CTRL_H__

//*****************************************************************************
//
// The following are defines for the SYS_CTRL register offsets.
//
//*****************************************************************************
#define SYS_CTRL_CLOCK_CTRL     0x400D2000  // The clock control register 
                                            // handels clock settings in the 
                                            // CC2538. The settings in 
                                            // CLOCK_CTRL do not always reflect 
                                            // the current chip status which is 
                                            // found in CLOCK_STA register. 
#define SYS_CTRL_CLOCK_STA      0x400D2004  // Clock status register This 
                                            // register reflects the current 
                                            // chip status. 
#define SYS_CTRL_RCGCGPT        0x400D2008  // This register defines the 
                                            // module clocks for GPT[3:0] when 
                                            // the CPU is in active (run) mode. 
                                            // This register setting is don't 
                                            // care for PM1-3, because the 
                                            // system clock is powered down in 
                                            // these modes. 
#define SYS_CTRL_SCGCGPT        0x400D200C  // This register defines the 
                                            // module clocks for GPT[3:0] when 
                                            // the CPU is in sleep mode. This 
                                            // register setting is don't care 
                                            // for PM1-3, because the system 
                                            // clock is powered down in these 
                                            // modes. 
#define SYS_CTRL_DCGCGPT        0x400D2010  // This register defines the 
                                            // module clocks for GPT[3:0] when 
                                            // the CPU is in PM0. This register 
                                            // setting is don't care for PM1-3, 
                                            // because the system clock is 
                                            // powered down in these modes. 
#define SYS_CTRL_SRGPT          0x400D2014  // This register controls the 
                                            // reset for GPT[3:0]. 
#define SYS_CTRL_RCGCSSI        0x400D2018  // This register defines the 
                                            // module clocks for SSI[1:0] when 
                                            // the CPU is in active (run) mode. 
                                            // This register setting is don't 
                                            // care for PM1-3, because the 
                                            // system clock is powered down in 
                                            // these modes. 
#define SYS_CTRL_SCGCSSI        0x400D201C  // This register defines the 
                                            // module clocks for SSI[1:0] when 
                                            // the CPU is insSleep mode. This 
                                            // register setting is don't care 
                                            // for PM1-3, because the system 
                                            // clock is powered down in these 
                                            // modes. 
#define SYS_CTRL_DCGCSSI        0x400D2020  // This register defines the 
                                            // module clocks for SSI[1:0] when 
                                            // the CPU is in PM0. This register 
                                            // setting is don't care for PM1-3, 
                                            // because the system clock is 
                                            // powered down in these modes. 
#define SYS_CTRL_SRSSI          0x400D2024  // This register controls the 
                                            // reset for SSI[1:0]. 
#define SYS_CTRL_RCGCUART       0x400D2028  // This register defines the 
                                            // module clocks for UART[1:0] when 
                                            // the CPU is in active (run) mode. 
                                            // This register setting is don't 
                                            // care for PM1-3, because the 
                                            // system clock is powered down in 
                                            // these modes. 
#define SYS_CTRL_SCGCUART       0x400D202C  // This register defines the 
                                            // module clocks for UART[1:0] when 
                                            // the CPU is in sleep mode. This 
                                            // register setting is don't care 
                                            // for PM1-3, because the system 
                                            // clock is powered down in these 
                                            // modes. 
#define SYS_CTRL_DCGCUART       0x400D2030  // This register defines the 
                                            // module clocks for UART[1:0] when 
                                            // the CPU is in PM0. This register 
                                            // setting is don't care for PM1-3, 
                                            // because the system clock is 
                                            // powered down in these modes. 
#define SYS_CTRL_SRUART         0x400D2034  // This register controls the 
                                            // reset for UART[1:0]. 
#define SYS_CTRL_RCGCI2C        0x400D2038  // This register defines the 
                                            // module clocks for I2C when the 
                                            // CPU is in active (run) mode. 
                                            // This register setting is don't 
                                            // care for PM1-3, because the 
                                            // system clock is powered down in 
                                            // these modes. 
#define SYS_CTRL_SCGCI2C        0x400D203C  // This register defines the 
                                            // module clocks for I2C when the 
                                            // CPU is in sleep mode. This 
                                            // register setting is don't care 
                                            // for PM1-3, because the system 
                                            // clock is powered down in these 
                                            // modes. 
#define SYS_CTRL_DCGCI2C        0x400D2040  // This register defines the 
                                            // module clocks for I2C when the 
                                            // CPU is in PM0. This register 
                                            // setting is don't care for PM1-3, 
                                            // because the system clock is 
                                            // powered down in these modes. 
#define SYS_CTRL_SRI2C          0x400D2044  // This register controls the 
                                            // reset for I2C. 
#define SYS_CTRL_RCGCSEC        0x400D2048  // This register defines the 
                                            // module clocks for the security 
                                            // module when the CPU is in active 
                                            // (run) mode. This register 
                                            // setting is don't care for PM1-3, 
                                            // because the system clock is 
                                            // powered down in these modes. 
#define SYS_CTRL_SCGCSEC        0x400D204C  // This register defines the 
                                            // module clocks for the security 
                                            // module when the CPU is in sleep 
                                            // mode. This register setting is 
                                            // don't care for PM1-3, because 
                                            // the system clock is powered down 
                                            // in these modes. 
#define SYS_CTRL_DCGCSEC        0x400D2050  // This register defines the 
                                            // module clocks for the security 
                                            // module when the CPU is in PM0. 
                                            // This register setting is don't 
                                            // care for PM1-3, because the 
                                            // system clock is powered down in 
                                            // these modes. 
#define SYS_CTRL_SRSEC          0x400D2054  // This register controls the 
                                            // reset for the security module. 
#define SYS_CTRL_PMCTL          0x400D2058  // This register controls the 
                                            // power mode. Note: The 
                                            // Corresponding PM is not entered 
                                            // before the WFI instruction is 
                                            // asserted. To enter PM1-3 the 
                                            // DEEPSLEEP bit in SYSCTRL must be 
                                            // 1. 
#define SYS_CTRL_SRCRC          0x400D205C  // This register controls CRC on 
                                            // state retention. 
#define SYS_CTRL_PWRDBG         0x400D2074  // Power debug register 
#define SYS_CTRL_CLD            0x400D2080  // This register controls the 
                                            // clock loss detection feature. 
#define SYS_CTRL_IWE            0x400D2094  // This register controls 
                                            // interrupt wake-up. 
#define SYS_CTRL_I_MAP          0x400D2098  // This register selects which 
                                            // interrupt map to be used. 
#define SYS_CTRL_RCGCRFC        0x400D20A8  // This register defines the 
                                            // module clocks for RF CORE when 
                                            // the CPU is in active (run) mode. 
                                            // This register setting is don't 
                                            // care for PM1-3, because the 
                                            // system clock is powered down in 
                                            // these modes. 
#define SYS_CTRL_SCGCRFC        0x400D20AC  // This register defines the 
                                            // module clocks for RF CORE when 
                                            // the CPU is in sleep mode. This 
                                            // register setting is don't care 
                                            // for PM1-3, because the system 
                                            // clock is powered down in these 
                                            // modes. 
#define SYS_CTRL_DCGCRFC        0x400D20B0  // This register defines the 
                                            // module clocks for RF CORE when 
                                            // the CPU is in PM0. This register 
                                            // setting is don't care for PM1-3, 
                                            // because the system clock is 
                                            // powered down in these modes. 
#define SYS_CTRL_EMUOVR         0x400D20B4  // This register defines the 
                                            // emulator override controls for 
                                            // power mode and peripheral clock 
                                            // gate. 


//*****************************************************************************
//
// The following are defines for the bit fields in the 
// SYS_CTRL_CLOCK_CTRL register.
//
//*****************************************************************************
#define SYS_CTRL_CLOCK_CTRL_OSC32K_CALDIS \
                                0x02000000  // Disable calibration 32-kHz RC 
                                            // oscillator. 0: Enable 
                                            // calibration 1: Disable 
                                            // calibration 

