RIOT-OS/RIOT/cpu/cc2538/include/vendor/hw_sys_ctrl.h
#define SYS_CTRL_CLOCK_CTRL_OSC32K_CALDIS_M \
                                0x02000000
#define SYS_CTRL_CLOCK_CTRL_OSC32K_CALDIS_S 25
#define SYS_CTRL_CLOCK_CTRL_OSC32K \
                                0x01000000  // 32-kHz clock oscillator 
                                            // selection 0: 32-kHz crystal 
                                            // oscillator 1: 32-kHz RC 
                                            // oscillator 

#define SYS_CTRL_CLOCK_CTRL_OSC32K_M \
                                0x01000000
#define SYS_CTRL_CLOCK_CTRL_OSC32K_S 24
#define SYS_CTRL_CLOCK_CTRL_AMP_DET \
                                0x00200000  // Amplitude detector of XOSC 
                                            // during power up 0: No action 1: 
                                            // Delay qualification of XOSC 
                                            // until amplitude is greater than 
                                            // the threshold. 

#define SYS_CTRL_CLOCK_CTRL_AMP_DET_M \
                                0x00200000
#define SYS_CTRL_CLOCK_CTRL_AMP_DET_S 21
#define SYS_CTRL_CLOCK_CTRL_OSC_PD \
                                0x00020000  // 0: Power up both oscillators 1: 
                                            // Power down oscillator not 
                                            // selected by OSC bit 
                                            // (hardware-controlled when 
                                            // selected). 

#define SYS_CTRL_CLOCK_CTRL_OSC_PD_M \
                                0x00020000
#define SYS_CTRL_CLOCK_CTRL_OSC_PD_S 17
#define SYS_CTRL_CLOCK_CTRL_OSC 0x00010000  // System clock oscillator 
                                            // selection 0: 32-MHz crystal 
                                            // oscillator 1: 16-MHz HF-RC 
                                            // oscillator 
#define SYS_CTRL_CLOCK_CTRL_OSC_M \
                                0x00010000
#define SYS_CTRL_CLOCK_CTRL_OSC_S 16
#define SYS_CTRL_CLOCK_CTRL_IO_DIV_M \
                                0x00000700  // I/O clock rate setting Cannot 
                                            // be higher than OSC setting 000: 
                                            // 32 MHz 001: 16 MHz 010: 8 MHz 
                                            // 011: 4 MHz 100: 2 MHz 101: 1 MHz 
                                            // 110: 0.5 MHz 111: 0.25 MHz 

#define SYS_CTRL_CLOCK_CTRL_IO_DIV_S 8
#define SYS_CTRL_CLOCK_CTRL_SYS_DIV_M \
                                0x00000007  // System clock rate setting 
                                            // Cannot be higher than OSC 
                                            // setting 000: 32 MHz 001: 16 MHz 
                                            // 010: 8 MHz 011: 4 MHz 100: 2 MHz 
                                            // 101: 1 MHz 110: 0.5 MHz 111: 
                                            // 0.25 MHz 

#define SYS_CTRL_CLOCK_CTRL_SYS_DIV_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// SYS_CTRL_CLOCK_STA register.
//
//*****************************************************************************
#define SYS_CTRL_CLOCK_STA_SYNC_32K \
                                0x04000000  // 32-kHz clock source synced to 
                                            // undivided system clock (16 or 32 
                                            // MHz). 

#define SYS_CTRL_CLOCK_STA_SYNC_32K_M \
                                0x04000000
#define SYS_CTRL_CLOCK_STA_SYNC_32K_S 26
#define SYS_CTRL_CLOCK_STA_OSC32K_CALDIS \
                                0x02000000  // Disable calibration 32-kHz RC 
                                            // oscillator. 0: Calibration 
                                            // enabled 1: Calibration disabled 

#define SYS_CTRL_CLOCK_STA_OSC32K_CALDIS_M \
                                0x02000000
#define SYS_CTRL_CLOCK_STA_OSC32K_CALDIS_S 25
#define SYS_CTRL_CLOCK_STA_OSC32K \
                                0x01000000  // Current 32-kHz clock oscillator 
                                            // selected. 0: 32-kHz crystal 
                                            // oscillator 1: 32-kHz RC 
                                            // oscillator 

#define SYS_CTRL_CLOCK_STA_OSC32K_M \
                                0x01000000
#define SYS_CTRL_CLOCK_STA_OSC32K_S 24
#define SYS_CTRL_CLOCK_STA_RST_M \
                                0x00C00000  // Returns last source of reset 
                                            // 00: POR 01: External reset 10: 
                                            // WDT 11: CLD or software reset 

#define SYS_CTRL_CLOCK_STA_RST_S 22
#define SYS_CTRL_CLOCK_STA_SOURCE_CHANGE \
                                0x00100000  // 0: System clock is not 
                                            // requested to change. 1: A change 
                                            // of system clock source has been 
                                            // initiated and is not finished. 
                                            // Same as when OSC bit in 
                                            // CLOCK_STA and CLOCK_CTRL 
                                            // register are not equal 

#define SYS_CTRL_CLOCK_STA_SOURCE_CHANGE_M \
                                0x00100000
#define SYS_CTRL_CLOCK_STA_SOURCE_CHANGE_S 20
#define SYS_CTRL_CLOCK_STA_XOSC_STB \
                                0x00080000  // XOSC stable status 0: XOSC is 
                                            // not powered up or not yet 
                                            // stable. 1: XOSC is powered up 
                                            // and stable. 

#define SYS_CTRL_CLOCK_STA_XOSC_STB_M \
                                0x00080000
#define SYS_CTRL_CLOCK_STA_XOSC_STB_S 19
#define SYS_CTRL_CLOCK_STA_HSOSC_STB \
                                0x00040000  // HSOSC stable status 0: HSOSC is 
                                            // not powered up or not yet 
                                            // stable. 1: HSOSC is powered up 
                                            // and stable. 

#define SYS_CTRL_CLOCK_STA_HSOSC_STB_M \
                                0x00040000
#define SYS_CTRL_CLOCK_STA_HSOSC_STB_S 18
#define SYS_CTRL_CLOCK_STA_OSC_PD \
                                0x00020000  // 0: Both oscillators powered up 
                                            // and stable and OSC_PD_CMD = 0. 
                                            // 1: Oscillator not selected by 
                                            // CLOCK_CTRL.OSC bit is powered 
                                            // down. 

#define SYS_CTRL_CLOCK_STA_OSC_PD_M \
                                0x00020000
#define SYS_CTRL_CLOCK_STA_OSC_PD_S 17
#define SYS_CTRL_CLOCK_STA_OSC  0x00010000  // Current clock source selected 
                                            // 0: 32-MHz crystal oscillator 1: 
                                            // 16-MHz HF-RC oscillator 
#define SYS_CTRL_CLOCK_STA_OSC_M \
                                0x00010000
#define SYS_CTRL_CLOCK_STA_OSC_S 16
#define SYS_CTRL_CLOCK_STA_IO_DIV_M \
                                0x00000700  // Returns current functional 
                                            // frequency for IO_CLK (may differ 
                                            // from setting in the CLOCK_CTRL 
                                            // register) 000: 32 MHz 001: 16 
                                            // MHz 010: 8 MHz 011: 4 MHz 100: 2 
                                            // MHz 101: 1 MHz 110: 0.5 MHz 111: 
                                            // 0.25 MHz 

#define SYS_CTRL_CLOCK_STA_IO_DIV_S 8
#define SYS_CTRL_CLOCK_STA_RTCLK_FREQ_M \
                                0x00000018  // Returns current functional 
                                            // frequency for real-time clock. 
                                            // (may differ from setting in the 
                                            // CLOCK_CTRL register) 1x : 8 MHz 
                                            // 01: 2 MHz 00: 62.5 kHz 

#define SYS_CTRL_CLOCK_STA_RTCLK_FREQ_S 3
#define SYS_CTRL_CLOCK_STA_SYS_DIV_M \
                                0x00000007  // Returns current functional 
                                            // frequency for system clock (may 
                                            // differ from setting in the 
                                            // CLOCK_CTRL register) 000: 32 MHz 
                                            // 001: 16 MHz 010: 8 MHz 011: 4 
                                            // MHz 100: 2 MHz 101: 1 MHz 110: 
                                            // 0.5 MHz 111: 0.25 MHz 

