RIOT-OS/RIOT/cpu/cc2538/include/vendor/hw_sys_ctrl.h
#define SYS_CTRL_CLOCK_STA_SYS_DIV_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// SYS_CTRL_RCGCGPT register.
//
//*****************************************************************************
#define SYS_CTRL_RCGCGPT_GPT3   0x00000008  // 0: Clock for GPT3 is gated. 1: 
                                            // Clock for GPT3 is enabled. 
#define SYS_CTRL_RCGCGPT_GPT3_M 0x00000008
#define SYS_CTRL_RCGCGPT_GPT3_S 3
#define SYS_CTRL_RCGCGPT_GPT2   0x00000004  // 0: Clock for GPT2 is gated. 1: 
                                            // Clock for GPT2 is enabled. 
#define SYS_CTRL_RCGCGPT_GPT2_M 0x00000004
#define SYS_CTRL_RCGCGPT_GPT2_S 2
#define SYS_CTRL_RCGCGPT_GPT1   0x00000002  // 0: Clock for GPT1 is gated. 1: 
                                            // Clock for GPT1 is enabled. 
#define SYS_CTRL_RCGCGPT_GPT1_M 0x00000002
#define SYS_CTRL_RCGCGPT_GPT1_S 1
#define SYS_CTRL_RCGCGPT_GPT0   0x00000001  // 0: Clock for GPT0 is gated. 1: 
                                            // Clock for GPT0 is enabled. 
#define SYS_CTRL_RCGCGPT_GPT0_M 0x00000001
#define SYS_CTRL_RCGCGPT_GPT0_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// SYS_CTRL_SCGCGPT register.
//
//*****************************************************************************
#define SYS_CTRL_SCGCGPT_GPT3   0x00000008  // 0: Clock for GPT3 is gated. 1: 
                                            // Clock for GPT3 is enabled. 
#define SYS_CTRL_SCGCGPT_GPT3_M 0x00000008
#define SYS_CTRL_SCGCGPT_GPT3_S 3
#define SYS_CTRL_SCGCGPT_GPT2   0x00000004  // 0: Clock for GPT2 is gated. 1: 
                                            // Clock for GPT2 is enabled. 
#define SYS_CTRL_SCGCGPT_GPT2_M 0x00000004
#define SYS_CTRL_SCGCGPT_GPT2_S 2
#define SYS_CTRL_SCGCGPT_GPT1   0x00000002  // 0: Clock for GPT1 is gated. 1: 
                                            // Clock for GPT1 is enabled. 
#define SYS_CTRL_SCGCGPT_GPT1_M 0x00000002
#define SYS_CTRL_SCGCGPT_GPT1_S 1
#define SYS_CTRL_SCGCGPT_GPT0   0x00000001  // 0: Clock for GPT0 is gated. 1: 
                                            // Clock for GPT0 is enabled. 
#define SYS_CTRL_SCGCGPT_GPT0_M 0x00000001
#define SYS_CTRL_SCGCGPT_GPT0_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// SYS_CTRL_DCGCGPT register.
//
//*****************************************************************************
#define SYS_CTRL_DCGCGPT_GPT3   0x00000008  // 0: Clock for GPT3 is gated. 1: 
                                            // Clock for GPT3 is enabled. 
#define SYS_CTRL_DCGCGPT_GPT3_M 0x00000008
#define SYS_CTRL_DCGCGPT_GPT3_S 3
#define SYS_CTRL_DCGCGPT_GPT2   0x00000004  // 0: Clock for GPT2 is gated. 1: 
                                            // Clock for GPT2 is enabled. 
#define SYS_CTRL_DCGCGPT_GPT2_M 0x00000004
#define SYS_CTRL_DCGCGPT_GPT2_S 2
#define SYS_CTRL_DCGCGPT_GPT1   0x00000002  // 0: Clock for GPT1 is gated. 1: 
                                            // Clock for GPT1 is enabled. 
#define SYS_CTRL_DCGCGPT_GPT1_M 0x00000002
#define SYS_CTRL_DCGCGPT_GPT1_S 1
#define SYS_CTRL_DCGCGPT_GPT0   0x00000001  // 0: Clock for GPT0 is gated. 1: 
                                            // Clock for GPT0 is enabled. 
#define SYS_CTRL_DCGCGPT_GPT0_M 0x00000001
#define SYS_CTRL_DCGCGPT_GPT0_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// SYS_CTRL_SRGPT register.
//
//*****************************************************************************
#define SYS_CTRL_SRGPT_GPT3     0x00000008  // 0: GPT3 module is not reset 1: 
                                            // GPT3 module is reset 
#define SYS_CTRL_SRGPT_GPT3_M   0x00000008
#define SYS_CTRL_SRGPT_GPT3_S   3
#define SYS_CTRL_SRGPT_GPT2     0x00000004  // 0: GPT2 module is not reset 1: 
                                            // GPT2 module is reset 
#define SYS_CTRL_SRGPT_GPT2_M   0x00000004
#define SYS_CTRL_SRGPT_GPT2_S   2
#define SYS_CTRL_SRGPT_GPT1     0x00000002  // 0: GPT1 module is not reset 1: 
                                            // GPT1 module is reset 
#define SYS_CTRL_SRGPT_GPT1_M   0x00000002
#define SYS_CTRL_SRGPT_GPT1_S   1
#define SYS_CTRL_SRGPT_GPT0     0x00000001  // 0: GPT0 module is not reset 1: 
                                            // GPT0 module is reset 
#define SYS_CTRL_SRGPT_GPT0_M   0x00000001
#define SYS_CTRL_SRGPT_GPT0_S   0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// SYS_CTRL_RCGCSSI register.
//
//*****************************************************************************
#define SYS_CTRL_RCGCSSI_SSI1   0x00000002  // 0: Clock for SSI1 is gated. 1: 
                                            // Clock for SSI1 is enabled. 
#define SYS_CTRL_RCGCSSI_SSI1_M 0x00000002
#define SYS_CTRL_RCGCSSI_SSI1_S 1
#define SYS_CTRL_RCGCSSI_SSI0   0x00000001  // 0: Clock for SSI0 is gated. 1: 
                                            // Clock for SSI0 is enabled. 
#define SYS_CTRL_RCGCSSI_SSI0_M 0x00000001
#define SYS_CTRL_RCGCSSI_SSI0_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// SYS_CTRL_SCGCSSI register.
//
//*****************************************************************************
#define SYS_CTRL_SCGCSSI_SSI1   0x00000002  // 0: Clock for SSI1 is gated. 1: 
                                            // Clock for SSI1 is enabled. 
#define SYS_CTRL_SCGCSSI_SSI1_M 0x00000002
#define SYS_CTRL_SCGCSSI_SSI1_S 1
#define SYS_CTRL_SCGCSSI_SSI0   0x00000001  // 0: Clock for SSI0 is gated. 1: 
                                            // Clock for SSI0 is enabled. 
#define SYS_CTRL_SCGCSSI_SSI0_M 0x00000001
#define SYS_CTRL_SCGCSSI_SSI0_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// SYS_CTRL_DCGCSSI register.
//
//*****************************************************************************
#define SYS_CTRL_DCGCSSI_SSI1   0x00000002  // 0: Clock for SSI1 is gated. 1: 
                                            // Clock for SSI1 is enabled. 
#define SYS_CTRL_DCGCSSI_SSI1_M 0x00000002
#define SYS_CTRL_DCGCSSI_SSI1_S 1
#define SYS_CTRL_DCGCSSI_SSI0   0x00000001  // 0: Clock for SSI0 is gated. 1: 
                                            // Clock for SSI0 is enabled. 
#define SYS_CTRL_DCGCSSI_SSI0_M 0x00000001
#define SYS_CTRL_DCGCSSI_SSI0_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// SYS_CTRL_SRSSI register.
//
//*****************************************************************************
#define SYS_CTRL_SRSSI_SSI1     0x00000002  // 0: SSI1 module is not reset 1: 
                                            // SSI1 module is reset 
#define SYS_CTRL_SRSSI_SSI1_M   0x00000002
#define SYS_CTRL_SRSSI_SSI1_S   1
#define SYS_CTRL_SRSSI_SSI0     0x00000001  // 0: SSI0 module is not reset 1: 
                                            // SSI0 module is reset 
#define SYS_CTRL_SRSSI_SSI0_M   0x00000001
#define SYS_CTRL_SRSSI_SSI0_S   0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// SYS_CTRL_RCGCUART register.
//
//*****************************************************************************
#define SYS_CTRL_RCGCUART_UART1 0x00000002  // 0: Clock for UART1 is gated. 1: 
                                            // Clock for UART1 is enabled. 
#define SYS_CTRL_RCGCUART_UART1_M \
                                0x00000002
#define SYS_CTRL_RCGCUART_UART1_S 1
#define SYS_CTRL_RCGCUART_UART0 0x00000001  // 0: Clock for UART0 is gated. 1: 
                                            // Clock for UART0 is enabled. 
#define SYS_CTRL_RCGCUART_UART0_M \
                                0x00000001
#define SYS_CTRL_RCGCUART_UART0_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// SYS_CTRL_SCGCUART register.
//
//*****************************************************************************
#define SYS_CTRL_SCGCUART_UART1 0x00000002  // 0: Clock for UART1 is gated. 1: 
                                            // Clock for UART1 is enabled. 
#define SYS_CTRL_SCGCUART_UART1_M \
                                0x00000002
#define SYS_CTRL_SCGCUART_UART1_S 1
#define SYS_CTRL_SCGCUART_UART0 0x00000001  // 0: Clock for UART0 is gated. 1: 
                                            // Clock for UART0 is enabled. 
#define SYS_CTRL_SCGCUART_UART0_M \
                                0x00000001
#define SYS_CTRL_SCGCUART_UART0_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// SYS_CTRL_DCGCUART register.
//
//*****************************************************************************
#define SYS_CTRL_DCGCUART_UART1 0x00000002  // 0: Clock for UART1 is gated. 1: 
                                            // Clock for UART1 is enabled. 
#define SYS_CTRL_DCGCUART_UART1_M \
                                0x00000002
#define SYS_CTRL_DCGCUART_UART1_S 1
#define SYS_CTRL_DCGCUART_UART0 0x00000001  // 0: Clock for UART0 is gated. 1: 
                                            // Clock for UART0 is enabled. 
#define SYS_CTRL_DCGCUART_UART0_M \
                                0x00000001
#define SYS_CTRL_DCGCUART_UART0_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// SYS_CTRL_SRUART register.
//
//*****************************************************************************
#define SYS_CTRL_SRUART_UART1   0x00000002  // 0: UART1 module is not reset 1: 
                                            // UART1 module is reset 
#define SYS_CTRL_SRUART_UART1_M 0x00000002
#define SYS_CTRL_SRUART_UART1_S 1
#define SYS_CTRL_SRUART_UART0   0x00000001  // 0: UART0 module is not reset 1: 
                                            // UART0 module is reset 
#define SYS_CTRL_SRUART_UART0_M 0x00000001
#define SYS_CTRL_SRUART_UART0_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// SYS_CTRL_RCGCI2C register.
//
//*****************************************************************************
#define SYS_CTRL_RCGCI2C_I2C0   0x00000001  // 0: Clock for I2C0 is gated. 1: 
                                            // Clock for I2C0 is enabled. 
#define SYS_CTRL_RCGCI2C_I2C0_M 0x00000001
#define SYS_CTRL_RCGCI2C_I2C0_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// SYS_CTRL_SCGCI2C register.
//
//*****************************************************************************
#define SYS_CTRL_SCGCI2C_I2C0   0x00000001  // 0: Clock for I2C0 is gated. 1: 
                                            // Clock for I2C0 is enabled. 
#define SYS_CTRL_SCGCI2C_I2C0_M 0x00000001
#define SYS_CTRL_SCGCI2C_I2C0_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// SYS_CTRL_DCGCI2C register.
//
//*****************************************************************************
#define SYS_CTRL_DCGCI2C_I2C0   0x00000001  // 0: Clock for I2C0 is gated. 1: 
                                            // Clock for I2C0 is enabled. 
#define SYS_CTRL_DCGCI2C_I2C0_M 0x00000001
#define SYS_CTRL_DCGCI2C_I2C0_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// SYS_CTRL_SRI2C register.
//
//*****************************************************************************
#define SYS_CTRL_SRI2C_I2C0     0x00000001  // 0: I2C0 module is not reset 1: 
                                            // I2C0 module is reset 
#define SYS_CTRL_SRI2C_I2C0_M   0x00000001
#define SYS_CTRL_SRI2C_I2C0_S   0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// SYS_CTRL_RCGCSEC register.
//
//*****************************************************************************
#define SYS_CTRL_RCGCSEC_AES    0x00000002  // 0: Clock for AES is gated. 1: 
                                            // Clock for AES is enabled. 
#define SYS_CTRL_RCGCSEC_AES_M  0x00000002
#define SYS_CTRL_RCGCSEC_AES_S  1
#define SYS_CTRL_RCGCSEC_PKA    0x00000001  // 0: Clock for PKA is gated. 1: 
                                            // Clock for PKA is enabled. 
#define SYS_CTRL_RCGCSEC_PKA_M  0x00000001
#define SYS_CTRL_RCGCSEC_PKA_S  0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// SYS_CTRL_SCGCSEC register.
//
//*****************************************************************************
#define SYS_CTRL_SCGCSEC_AES    0x00000002  // 0: Clock for AES is gated. 1: 
                                            // Clock for AES is enabled. 
#define SYS_CTRL_SCGCSEC_AES_M  0x00000002
#define SYS_CTRL_SCGCSEC_AES_S  1
#define SYS_CTRL_SCGCSEC_PKA    0x00000001  // 0: Clock for PKA is gated. 1: 
                                            // Clock for PKA is enabled. 
#define SYS_CTRL_SCGCSEC_PKA_M  0x00000001
#define SYS_CTRL_SCGCSEC_PKA_S  0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// SYS_CTRL_DCGCSEC register.
//
//*****************************************************************************
#define SYS_CTRL_DCGCSEC_AES    0x00000002  // 0: Clock for AES is gated. 1: 
                                            // Clock for AES is enabled. 
#define SYS_CTRL_DCGCSEC_AES_M  0x00000002
#define SYS_CTRL_DCGCSEC_AES_S  1
#define SYS_CTRL_DCGCSEC_PKA    0x00000001  // 0: Clock for PKA is gated. 1: 
                                            // Clock for PKA is enabled. 
#define SYS_CTRL_DCGCSEC_PKA_M  0x00000001
#define SYS_CTRL_DCGCSEC_PKA_S  0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// SYS_CTRL_SRSEC register.
//
//*****************************************************************************
#define SYS_CTRL_SRSEC_AES      0x00000002  // 0: AES module is not reset 1: 
                                            // AES module is reset 
#define SYS_CTRL_SRSEC_AES_M    0x00000002
#define SYS_CTRL_SRSEC_AES_S    1
#define SYS_CTRL_SRSEC_PKA      0x00000001  // 0: PKA module is not reset 1: 
                                            // PKA module is reset 
#define SYS_CTRL_SRSEC_PKA_M    0x00000001
#define SYS_CTRL_SRSEC_PKA_S    0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// SYS_CTRL_PMCTL register.
//
//*****************************************************************************
#define SYS_CTRL_PMCTL_PM_M     0x00000003  // 00: No action 01: PM1 10: PM2 
                                            // 11: PM3 
#define SYS_CTRL_PMCTL_PM_S     0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// SYS_CTRL_SRCRC register.
//
//*****************************************************************************
#define SYS_CTRL_SRCRC_CRC_REN_USB \
                                0x00000100  // 1: Enable reset of chip if CRC 
                                            // fails. 0: Disable reset feature 
                                            // of chip due to CRC. 

#define SYS_CTRL_SRCRC_CRC_REN_USB_M \
                                0x00000100
#define SYS_CTRL_SRCRC_CRC_REN_USB_S 8
#define SYS_CTRL_SRCRC_CRC_REN_RF \
                                0x00000001  // 1: Enable reset of chip if CRC 
                                            // fails. 0: Disable reset feature 
                                            // of chip due to CRC. 

#define SYS_CTRL_SRCRC_CRC_REN_RF_M \
                                0x00000001
#define SYS_CTRL_SRCRC_CRC_REN_RF_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// SYS_CTRL_PWRDBG register.
//
//*****************************************************************************
#define SYS_CTRL_PWRDBG_FORCE_WARM_RESET \
                                0x00000008  // 0: No action 1: When written 
                                            // high, the chip is reset in the 
                                            // same manner as a CLD event and 
                                            // is readable from the RST field 
                                            // in the CLOCK_STA register. 

#define SYS_CTRL_PWRDBG_FORCE_WARM_RESET_M \
                                0x00000008
#define SYS_CTRL_PWRDBG_FORCE_WARM_RESET_S 3
//*****************************************************************************
//
// The following are defines for the bit fields in the SYS_CTRL_CLD register.
//
//*****************************************************************************
#define SYS_CTRL_CLD_VALID      0x00000100  // 0: CLD status in always-on 
                                            // domain is not equal to status in 
                                            // the EN register. 1: CLD status 
                                            // in always-on domain and EN 
                                            // register are equal. 
#define SYS_CTRL_CLD_VALID_M    0x00000100
#define SYS_CTRL_CLD_VALID_S    8
#define SYS_CTRL_CLD_EN         0x00000001  // 0: CLD is disabled. 1: CLD is 
                                            // enabled. Writing to this 
                                            // register shall be ignored if 
                                            // VALID = 0 
#define SYS_CTRL_CLD_EN_M       0x00000001
#define SYS_CTRL_CLD_EN_S       0
//*****************************************************************************
//
// The following are defines for the bit fields in the SYS_CTRL_IWE register.
//
//*****************************************************************************
#define SYS_CTRL_IWE_SM_TIMER_IWE \
                                0x00000020  // 1: Enable SM Timer wake-up 
                                            // interrupt. 0: Disable SM Timer 
                                            // wake-up interrupt. 

