RIOT-OS/RIOT/cpu/cc2538/include/vendor/hw_sys_ctrl.h
#define SYS_CTRL_IWE_SM_TIMER_IWE_M \
                                0x00000020
#define SYS_CTRL_IWE_SM_TIMER_IWE_S 5
#define SYS_CTRL_IWE_USB_IWE    0x00000010  // 1: Enable USB wake-up 
                                            // interrupt. 0: Disable USB 
                                            // wake-up interrupt. 
#define SYS_CTRL_IWE_USB_IWE_M  0x00000010
#define SYS_CTRL_IWE_USB_IWE_S  4
#define SYS_CTRL_IWE_PORT_D_IWE 0x00000008  // 1: Enable port D wake-up 
                                            // interrupt. 0: Disable port D 
                                            // wake-up interrupt. 
#define SYS_CTRL_IWE_PORT_D_IWE_M \
                                0x00000008
#define SYS_CTRL_IWE_PORT_D_IWE_S 3
#define SYS_CTRL_IWE_PORT_C_IWE 0x00000004  // 1: Enable port C wake-up 
                                            // interrupt. 0: Disable port C 
                                            // wake-up interrupt. 
#define SYS_CTRL_IWE_PORT_C_IWE_M \
                                0x00000004
#define SYS_CTRL_IWE_PORT_C_IWE_S 2
#define SYS_CTRL_IWE_PORT_B_IWE 0x00000002  // 1: Enable port B wake-up 
                                            // interrupt. 0: Disable port B 
                                            // wake-up interrupt. 
#define SYS_CTRL_IWE_PORT_B_IWE_M \
                                0x00000002
#define SYS_CTRL_IWE_PORT_B_IWE_S 1
#define SYS_CTRL_IWE_PORT_A_IWE 0x00000001  // 1: Enable port A wake-up 
                                            // interrupt. 0: Disable port A 
                                            // wake-up interrupt. 
#define SYS_CTRL_IWE_PORT_A_IWE_M \
                                0x00000001
#define SYS_CTRL_IWE_PORT_A_IWE_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// SYS_CTRL_I_MAP register.
//
//*****************************************************************************
#define SYS_CTRL_I_MAP_ALTMAP   0x00000001  // 1: Select alternate interrupt 
                                            // map. 0: Select regular interrupt 
                                            // map. (See the ASD document for 
                                            // details.) 
#define SYS_CTRL_I_MAP_ALTMAP_M 0x00000001
#define SYS_CTRL_I_MAP_ALTMAP_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// SYS_CTRL_RCGCRFC register.
//
//*****************************************************************************
#define SYS_CTRL_RCGCRFC_RFC0   0x00000001  // 0: Clock for RF CORE is gated. 
                                            // 1: Clock for RF CORE is enabled. 
#define SYS_CTRL_RCGCRFC_RFC0_M 0x00000001
#define SYS_CTRL_RCGCRFC_RFC0_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// SYS_CTRL_SCGCRFC register.
//
//*****************************************************************************
#define SYS_CTRL_SCGCRFC_RFC0   0x00000001  // 0: Clock for RF CORE is gated. 
                                            // 1: Clock for RF CORE is enabled. 
#define SYS_CTRL_SCGCRFC_RFC0_M 0x00000001
#define SYS_CTRL_SCGCRFC_RFC0_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// SYS_CTRL_DCGCRFC register.
//
//*****************************************************************************
#define SYS_CTRL_DCGCRFC_RFC0   0x00000001  // 0: Clock for RF CORE is gated. 
                                            // 1: Clock for RF CORE is enabled. 
#define SYS_CTRL_DCGCRFC_RFC0_M 0x00000001
#define SYS_CTRL_DCGCRFC_RFC0_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// SYS_CTRL_EMUOVR register.
//
//*****************************************************************************
#define SYS_CTRL_EMUOVR_ICEPICK_FORCE_CLOCK_CG \
                                0x00000080  // ICEPick 'Force Active' clock 
                                            // gate override bit. 'Force 
                                            // Active' is an ICEPick command. 1 
                                            // --> In non-sleep power mode, 
                                            // peripherals clocks are forced to 
                                            // follow RCG* register settings. 
                                            // It forces CM3 clocks on. 0 --> 
                                            // Does not affect the peripheral 
                                            // clock settings. 

#define SYS_CTRL_EMUOVR_ICEPICK_FORCE_CLOCK_CG_M \
                                0x00000080
#define SYS_CTRL_EMUOVR_ICEPICK_FORCE_CLOCK_CG_S 7
#define SYS_CTRL_EMUOVR_ICEPICK_FORCE_POWER_CG \
                                0x00000040  // ICEPick 'Force Power' clock 
                                            // gate override bit. 'Force Power' 
                                            // is an ICEPick command. 1 --> In 
                                            // non-sleep power mode, 
                                            // peripherals clocks are forced to 
                                            // follow RCG* register settings. 
                                            // It forces CM3 clocks on. 0 --> 
                                            // Does not affect the peripheral 
                                            // clock settings. 

#define SYS_CTRL_EMUOVR_ICEPICK_FORCE_POWER_CG_M \
                                0x00000040
#define SYS_CTRL_EMUOVR_ICEPICK_FORCE_POWER_CG_S 6
#define SYS_CTRL_EMUOVR_ICEPICK_INHIBIT_SLEEP_CG \
                                0x00000020  // ICEPick 'Inhibit Sleep' clock 
                                            // gate override bit. 'Inhibit 
                                            // Sleep' is an ICEPick command. 1 
                                            // --> In non-sleep power mode, 
                                            // peripherals clocks are forced to 
                                            // follow RCG* register settings. 
                                            // It forces CM3 clocks on. 0 --> 
                                            // Does not affect the peripheral 
                                            // clock settings. 

#define SYS_CTRL_EMUOVR_ICEPICK_INHIBIT_SLEEP_CG_M \
                                0x00000020
#define SYS_CTRL_EMUOVR_ICEPICK_INHIBIT_SLEEP_CG_S 5
#define SYS_CTRL_EMUOVR_ICEMELTER_WKUP_CG \
                                0x00000010  // ICEMelter 'WAKEUPEMU' clock 
                                            // gate override bit. 1 --> In 
                                            // non-sleep power mode, 
                                            // peripherals clocks are forced to 
                                            // follow RCG* register settings. 
                                            // It forces CM3 clocks on. 0 --> 
                                            // Does not affect the peripheral 
                                            // clock settings 

#define SYS_CTRL_EMUOVR_ICEMELTER_WKUP_CG_M \
                                0x00000010
#define SYS_CTRL_EMUOVR_ICEMELTER_WKUP_CG_S 4
#define SYS_CTRL_EMUOVR_ICEPICK_FORCE_CLOCK_PM \
                                0x00000008  // ICEPick 'Force Active' power 
                                            // mode override bit. 'Force 
                                            // Active' is an ICEPick command. 1 
                                            // --> Prohibit the system to go 
                                            // into any power down modes. Keeps 
                                            // the emulator attached. 0 --> 
                                            // Does not override any power mode 
                                            // settings from SYSREGS and does 
                                            // not prohibit system to go into 
                                            // any power down modes. 

