RIOT-OS/RIOT/cpu/cc2538/include/vendor/hw_sys_ctrl.h
#define SYS_CTRL_EMUOVR_ICEPICK_FORCE_CLOCK_PM_M \
                                0x00000008
#define SYS_CTRL_EMUOVR_ICEPICK_FORCE_CLOCK_PM_S 3
#define SYS_CTRL_EMUOVR_ICEPICK_FORCE_POWER_PM \
                                0x00000004  // ICEPick 'Force Power' power 
                                            // mode override bit. 'Force Power' 
                                            // is an ICEPick command. 1 --> 
                                            // Prohibit the system to go into 
                                            // any power down modes. Keeps the 
                                            // emulator attached. 0 --> Does 
                                            // not override any power mode 
                                            // settings from SYSREGS and does 
                                            // not prohibit system to go into 
                                            // any power down modes. 

#define SYS_CTRL_EMUOVR_ICEPICK_FORCE_POWER_PM_M \
                                0x00000004
#define SYS_CTRL_EMUOVR_ICEPICK_FORCE_POWER_PM_S 2
#define SYS_CTRL_EMUOVR_ICEPICK_INHIBIT_SLEEP_PM \
                                0x00000002  // ICEPick 'Inhibit Sleep' power 
                                            // mode override bit. 'Inhibit 
                                            // Sleep' is an ICEPick command. 1 
                                            // --> Prohibit the system to go 
                                            // into any power down modes. Keeps 
                                            // the emulator attached. 0 --> 
                                            // Does not override any power mode 
                                            // settings from SYSREGS and does 
                                            // not prohibit system to go into 
                                            // any power down modes. 

#define SYS_CTRL_EMUOVR_ICEPICK_INHIBIT_SLEEP_PM_M \
                                0x00000002
#define SYS_CTRL_EMUOVR_ICEPICK_INHIBIT_SLEEP_PM_S 1
#define SYS_CTRL_EMUOVR_ICEMELTER_WKUP_PM \
                                0x00000001  // ICEMelter 'WAKEUPEMU' power 
                                            // mode override bit. 1 --> 
                                            // Prohibit the system to go into 
                                            // any power down modes. Keeps the 
                                            // emulator attached. 0 --> Does 
                                            // not override any power mode 
                                            // settings from SYSREGS and does 
                                            // not prohibit system to go into 
                                            // any power down modes. 

#define SYS_CTRL_EMUOVR_ICEMELTER_WKUP_PM_M \
                                0x00000001
#define SYS_CTRL_EMUOVR_ICEMELTER_WKUP_PM_S 0


#endif // __HW_SYS_CTRL_H__

